sdaiUnsetAttrBN(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Restores a specified attribute in a specified application instance to the unset state.
\param instance      [in] An application instance to unset an attribute within.
\param attributeName [in] A string that contains the name of the attribute to unset.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiMX_NRW - SDAI-model access is not read-write.
* sdaiEI_NEXS - Instance does not exist.
* sdaiAT_NDEF - Attribute not defined.
* sdaiAT_NVLD - Attribute invalid.
* sdaiSY_ERR - Underlying system error.
\code
SdaiAppInstance ifcCircleProfileDef = sdaiCreateInstanceBN(model, "ifccircleprofiledef");
sdaiPutAttrBN(ifcCircleProfileDef, "radius", sdaiREAL, 0.5);
sdaiUnsetAttrBN(ifcCircleProfileDef, "radius");